Revit 2027 API
DefinitionFile.Filename Property
This property returns the physical filename of the shared parameters file on disk.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string Filename { get; }
Public ReadOnly Property Filename As String
	Get
public:
property String^ Filename {
	String^ get ();
}
member Filename : string with get
Property Value
String
See Also
Reference
DefinitionFile Class
Autodesk.Revit.DB Namespace